models/search/ClassroomTeacherSearch.php

SELECT * FROM `classrooms_plan` WHERE (`classroom_id` IS NULL) AND (`year` IS NULL) AND (`semester_id` IS NULL)
---
    public function search($params)
    {
        // echo "<pre>";
        // print_r($params);
        // echo "</pre>";
        // die;
        $query = AssignClassroomTeacherModel::find();

        // add conditions that should always apply here

        $dataProvider = new ActiveDataProvider([
            'query' => $query,
        ]);

        $this->load($params);
        // echo "<pre>";
        // print_r($this);
        // echo "</pre>";
        // die;

        if (!$this->validate()) {
            // uncomment the following line if you do not want to return any records when validation fails
            // $query->where('0=1');
            return $dataProvider;
        }

            $classroomsPlanModel = \app\models\ClassroomsPlanModel::find()->where([
                'classroom_id'=>$this->classroom_id,
                'year'=>$this->year,
                'semester_id'=>$this->semester_id
            ])->all();