models/AssignClassroomTeacherModel.php

SELECT * FROM `master_year`
---
	public static function getYearList()
	{
        return \yii\helpers\ArrayHelper::map(\app\models\MasterYearModel::find()->all(), 'year', 'year');

SELECT * FROM `assign_classroom_teacher` WHERE `teacher_id`=1
SELECT * FROM `classrooms_plan` WHERE `id` IN (1, 3, 4, 5, 6)
SELECT * FROM `classrooms` WHERE `id` IN (2, 3, 4, 5, 6)
---
	public static function getClassroomListByTeacher($teacher_id)
	{
		$ids = [];
		$model = self::find()->where([
			'teacher_id'=>$teacher_id,
		])->all();
		foreach($model as $modelData)
		{
			$ids[] = $modelData->classroom_id;
		}

		$ids = array_unique($ids);

		$classroom_ids = [];
		$getClassromsId = \app\models\ClassroomsPlanModel::find()->where(['id'=>$ids])->all();
		foreach($getClassromsId as $modelData)
		{
			$classroom_ids[] = $modelData->classroom_id;
		}

        return \yii\helpers\ArrayHelper::map(\app\models\ClassroomsModel::find()->where(['id'=>$classroom_ids])->all(), 'id', 'classroom_name');