models/MasterSemesterModel.php

	public static function getSemesterList()
	{
        return \yii\helpers\ArrayHelper::map(\app\models\MasterSemesterModel::find()->all(), 'id', 'desc');
---
SELECT * FROM `master_semester`