models/MasterSubjectsModel.php

SELECT * FROM `master_subjects`
---
	public static function getSubjectsList()
	{
        return \yii\helpers\ArrayHelper::map(self::find()->all(), 'id', 'subjects');