models/SubjectsPlanModel.php

    public static function getSubjectsPlanModelLists()
    {
        $model = self::find()->all();
---
SELECT * FROM `subjects_plan`