models/TeachersModel.php

	public static function getTeachersList($teacher_id=null)
	{
		if($teacher_id)
		{
	        return \yii\helpers\ArrayHelper::map(self::find()->where(['id'=>$teacher_id])->all(), 'id', 'full_name');
		}
		else
		{
	        return \yii\helpers\ArrayHelper::map(self::find()->all(), 'id', 'full_name');
---
SELECT * FROM `teachers`