models/User.php

    public static function findIdentity($id)
    {
        // return isset(self::$users[$id]) ? new static(self::$users[$id]) : null;
        return static::findOne($id);
---
SELECT * FROM `users` WHERE `id`=1